redis/results/results_blocksize_extended/raw_2MB_7015.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 138%,  41 secs]  0 threads 25 conns:       21301 ops,   32289 (avg:     516) ops/sec, 63.07GB/sec (avg: 1.01GB/sec), 59856.12 (avg: 68987.22) msec latency

16        Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          190.29          ---          ---     67722.82135     71827.45500     93847.55100     95944.70300    389726.76 
Gets          182.81       182.81         0.00     70301.31523     73400.31900     94371.83900     95944.70300    374394.97 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        373.10       182.81         0.00     68988.52400     72351.74300     94371.83900     95944.70300    764121.74