redis/results/results_blocksize_extended/raw_512KB_7009.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  30 secs]  0 threads 25 conns:       43190 ops,   52399 (avg:    1424) ops/sec, 25.59GB/sec (avg: 712.39MB/sec), 15331.27 (avg: 15272.63) msec latency

16        Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          670.42          ---          ---     15133.51496     15138.81500     30277.63100     32112.63900    343286.29 
Gets          657.71       657.71         0.00     15413.62377     15400.95900     31064.06300     32636.92700    336773.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1328.13       657.71         0.00     15272.28524     15269.88700     30670.84700     32374.78300    680059.87